/*! @file
  @brief クリップボード関連のクラス
  @author 依積晶紀
*/
#pragma once

#include	"Throwable.h"

/************************************************************************/
//! クリップボードのオープンとクローズを行うだけのラッパクラス
/************************************************************************/
class ClipboardManager
{
  public:
    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
    //! クリップボードをオープンする
    /*! @exception Error オープン失敗					*/
    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
    ClipboardManager()
    {
	if (!::OpenClipboard(NULL))
	    throw Error();
    }

    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
    //! クリップボードをクローズする
    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
    ~ClipboardManager()
    {
	::CloseClipboard();
    }
};

/************************************************************************/
//! クリップボードのデータ
/************************************************************************/
class ClipboardData
{
  private:
    ClipboardManager clip_;

    /* ---------------------------------------------------------------- */
    //! クリップボードオブジェクトのハンドル
    HANDLE h_;

    /* ---------------------------------------------------------------- */
    //! クリップボード内のデータを表すポインタ
    /*!
      取得前はNULL。
    */
    void* mem_;

  public:
    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
    //! クリップボードからデータを取得し、後の操作に備える。
    /*!
	@param [in] format データ形式
	@exception Error 取得に失敗					*/
    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
    ClipboardData(UINT format) : mem_(NULL)
    {
	h_ = ::GetClipboardData(format);	
	if (h_ == NULL)
	    throw Error();
    }

    ~ClipboardData()
    {
	if (mem_ != NULL)
	    ::GlobalUnlock(h_);
    }

    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
    //! クリップボードのデータサイズを取得する。
    /*!
	@return データサイズ(バイト数)
	@exception Error データが存在しない等				*/
    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
    DWORD get_size()
    {
	const DWORD size = ::GlobalSize(h_);
	if (size == 0)
	    throw Error();
	return size;
    }

    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
    //! クリップボード内のデータ（ポインタ）を取得する。
    /*! 初回呼び出し時に領域のロックを行う。
	@return クリップボード内のデータ
	@exception Error データが存在しない等				*/
    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
    const void* get_data()
    {
	if (mem_ == NULL) {
	    mem_ = ::GlobalLock(h_);
	    if (mem_ == NULL)
		throw Error();
	}
	return mem_;
    }
};
