/*! @file
  @brief テキストの出力先の作成
  @author 依積晶紀
*/
#pragma once

class Output;
class Property;
class PreviewWindow;

//////////////////////////////////////////////////////////////////////

/************************************************************************/
//! テキスト出力先のインスタンスを生成するクラス
/************************************************************************/
class OutputFactory
{
  public:
    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
    //! 出力先のインスタンスを作成する。
    /*!
      作成をキャンセルした時は、NULLを返す。
      
      戻り値として返されるインスタンスは、
      呼び出し元で delete すること。

      @param [in] prop 設定
      @param [in] title タイトル
      @return 出力先のインスタンス
      @exception Warning 設定値に問題あり				*/
    /* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
    virtual Output* get_output(const Property& prop, LPCTSTR title) = 0;
};

//////////////////////////////////////////////////////////////////////

/************************************************************************/
//! 印刷するためのテキスト出力先を生成するクラス
/************************************************************************/
class PrinterFactory : public OutputFactory
{
  public:
    virtual Output* get_output(const Property&, LPCTSTR);
};

//////////////////////////////////////////////////////////////////////

/************************************************************************/
//! プレビュー用のテキスト出力先を生成するクラス
/************************************************************************/
class PreviewFactory : public OutputFactory
{
  private:
    //! プレビュー画面
    PreviewWindow& preview_;

  public:
    PreviewFactory(PreviewWindow&);
    
    virtual Output* get_output(const Property&, LPCTSTR);
};

//////////////////////////////////////////////////////////////////////
