/*! @file
  @brief プレビュータブページ
  @author 依積晶紀
*/
#include	"stdafx.h"
#include	"TabPreview.h"

BEGIN_MESSAGE_MAP(TabPreview, TabPage)
    ON_COMMAND(IDC_PREVIEW, OnPreview)
    ON_COMMAND(IDC_PAGE_SETUP, OnPageSetup)
END_MESSAGE_MAP()

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
//! タブの初期化
/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
void TabPreview::init()
{
}

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
//! 設定値をコントロールに反映する
/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
void TabPreview::update_ctrl(const Property&)
{
}

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
//! コントロールの内容を設定に反映する
/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
void TabPreview::update_value(Property&) const
{
}

/* ==================================================================== */
//! [プレビュー]ボタン
/* ==================================================================== */
void TabPreview::OnPreview()
{
    GetParent()->PostMessage(WM_PREVIEW);
}

/* ==================================================================== */
//! [ページ設定]ボタン
/* ==================================================================== */
void TabPreview::OnPageSetup()
{
    GetParent()->PostMessage(WM_PAGE_SETUP);
}
